<a href="https://colab.research.google.com/github/19PA1A0283/AI-Lab/blob/master/Experiment_2_Pandas_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# EXPERIMENT 2 - PANDAS

## Importing the needed packages

In [1]:
import pandas as pd
import numpy as np

## 1) Creating a dataframe manually

In [2]:
import pandas as pd
import numpy as np
df=pd.DataFrame({"Roll No":["19PA1A0285","19PA1A0283","19PA1A02A8"],"Name":["S.Jashwanth","R.Manohar","Y.Manipavan"]})
df

      Roll No         Name
0  19PA1A0285  S.Jashwanth
1  19PA1A0283    R.Manohar
2  19PA1A02A8  Y.Manipavan

## 2) Importing data into a dataframe

In [15]:
df=pd.read_csv("students_placement_data.csv")
df.head()

   Roll No Gender  ... registered_for_ Placement_Training  placement status
0        1      M  ...                                 NO        Not placed
1        2      F  ...                                yes            Placed
2        3      F  ...                                yes        Not placed
3        4      M  ...                                yes        Not placed
4        5      M  ...                                yes        Not placed

[5 rows x 9 columns]

## 3) Adding,Daleting,Modifying rows/columns in a dataframe

### 3.1) Adding a column

In [18]:
 host_day=pd.read_csv("hostlers_day_scholars.csv")
host_day.head()

  hostler/days scholar
0                    d
1                    d
2                    d
3                    d
4                    h

In [17]:
 df["hostlers/days scholar"]=host_day.values
df.head()

   Roll No Gender  ... placement status  hostlers/days scholar
0        1      M  ...       Not placed                      d
1        2      F  ...           Placed                      d
2        3      F  ...       Not placed                      d
3        4      M  ...       Not placed                      d
4        5      M  ...       Not placed                      h

[5 rows x 10 columns]

### 3.2) Deleting a column

In [19]:
del df["registered_for_ Placement_Training"]
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
0        1      M       A  ...        18        Not placed                      d
1        2      F       A  ...         0            Placed                      d
2        3      F       A  ...        13        Not placed                      d
3        4      M       A  ...        17        Not placed                      d
4        5      M       A  ...        17        Not placed                      h

[5 rows x 9 columns]

### 3.3) Adding a row

In [20]:
 df1=pd.DataFrame({"Roll No": [83],"Gender": ["M"],"Section": ["B"],"SSC Percentage": [95.5],"inter_Diploma_percentage": [99],"B.Tech_percentage": [80],"Backlogs": [0],"placement status": ["Placed"],"hostlers/days scholar": ["d"]},index=[60])
df1

    Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
60       83      M       B  ...         0            Placed                      d

[1 rows x 9 columns]

In [21]:
df=df.append(df1)
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
0        1      M       A  ...        18        Not placed                      d
1        2      F       A  ...         0            Placed                      d
2        3      F       A  ...        13        Not placed                      d
3        4      M       A  ...        17        Not placed                      d
4        5      M       A  ...        17        Not placed                      h

[5 rows x 9 columns]

### 3.4) Deleting a row

In [22]:
 df=df.drop(4)
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
0        1      M       A  ...        18        Not placed                      d
1        2      F       A  ...         0            Placed                      d
2        3      F       A  ...        13        Not placed                      d
3        4      M       A  ...        17        Not placed                      d
5        6      M       A  ...         6        Not placed                      h

[5 rows x 9 columns]

### 3.5) Modifying the elements

In [24]:
 df.loc[3,"hostlers/days scholar"]="d"
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
0        1      M       A  ...        18        Not placed                      d
1        2      F       A  ...         0            Placed                      d
2        3      F       A  ...        13        Not placed                      d
3        4      M       A  ...        17        Not placed                      d
5        6      M       A  ...         6        Not placed                      h

[5 rows x 9 columns]

## 4) Applying functions on a dataframe

In [26]:
 def per(x):
  if(x<70):
    return(x+0.05)
  else:
    return(x)

In [27]:
df["B.Tech_percentage"]=df["B.Tech_percentage"].apply(per)
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
0        1      M       A  ...        18        Not placed                      d
1        2      F       A  ...         0            Placed                      d
2        3      F       A  ...        13        Not placed                      d
3        4      M       A  ...        17        Not placed                      d
5        6      M       A  ...         6        Not placed                      h

[5 rows x 9 columns]

## 5)Iterations on dataframe

In [31]:
 for index,rows in df[df["B.Tech_percentage"]>=80].iterrows():
  print(rows["Roll No"],"-",rows["B.Tech_percentage"])

18 - 85.39
60 - 81.1
71 - 80.47
97 - 88.1
102 - 83.38
83 - 80.0

## 6) Accessing the elements from a dataframe

In [32]:
 df.loc[[2,3],["SSC Percentage","inter_Diploma_percentage"]]

   SSC Percentage  inter_Diploma_percentage
2            67.0                      68.0
3            71.0                      70.4

## 7) Different ways to deal with NA's in dataframe

In [33]:
df["SSC Percentage"]=df["SSC Percentage"].replace(to_replace=np.nan,value=np.mean(df["SSC Percentage"]))
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
0        1      M       A  ...        18        Not placed                      d
1        2      F       A  ...         0            Placed                      d
2        3      F       A  ...        13        Not placed                      d
3        4      M       A  ...        17        Not placed                      d
5        6      M       A  ...         6        Not placed                      h

[5 rows x 9 columns]

## 8) Groupby operations on dataframe

In [34]:
group=df.groupby("Gender")
group["B.Tech_percentage"].agg(np.mean)

Gender
F    71.216735
M    57.588088
Name: B.Tech_percentage, dtype: float64

## 9) Merging the dataframes

In [35]:
df2=pd.read_csv("urban_rural.csv")
df2.head()

   Roll No Urban/Rural
0        1       Urban
1        2       Rural
2        6       Rural
3        7       Urban
4        8       Urban

In [36]:
df=pd.merge(df,df2,on="Roll No")
df.head()

   Roll No Gender Section  ...  placement status  hostlers/days scholar  Urban/Rural
0        1      M       A  ...        Not placed                      d        Urban
1        2      F       A  ...            Placed                      d        Rural
2        3      F       A  ...        Not placed                      d        Urban
3        4      M       A  ...        Not placed                      d        Urban
4        6      M       A  ...        Not placed                      h        Rural

[5 rows x 10 columns]